# Day 29 — Data Cleaning: Missing Values (Practice)

In [25]:

import pandas as pd
df = pd.read_csv("day_29_students_dirty.csv")
df

   student_id   name   age       city  math_score  attendance
0           1  Aanya  21.0      Delhi        85.0        92.0
1           2  Meera  22.0     Mumbai        90.0         NaN
2           3   Riya   NaN       Pune         NaN        85.0
3           4  Pooja  23.0        NaN        88.0        95.0
4           5  Sneha  22.0  Bangalore        92.0        98.0
5           6    Ira   NaN     Mumbai        74.0        80.0
6           7  Naina  21.0       Pune        81.0         NaN
7           8  Kavya  24.0      Delhi         NaN        83.0
8           9   Diya  23.0        NaN        95.0        97.0
9          10   Tara   NaN       Pune        87.0        90.0

## Exercise 1 — Detect missing values

In [26]:

# TODO: use isna() and isna().sum()

df.isna()

   student_id   name    age   city  math_score  attendance
0       False  False  False  False       False       False
1       False  False  False  False       False        True
2       False  False   True  False        True       False
3       False  False  False   True       False       False
4       False  False  False  False       False       False
5       False  False   True  False       False       False
6       False  False  False  False       False        True
7       False  False  False  False        True       False
8       False  False  False   True       False       False
9       False  False   True  False       False       False

In [27]:
df.isna().sum()

student_id    0
name          0
age           3
city          2
math_score    2
attendance    2
dtype: int64

## Exercise 2 — Quantify missing values

In [28]:

# TODO: calculate percentage of missing values

df.isna().mean()*100

student_id     0.0
name           0.0
age           30.0
city          20.0
math_score    20.0
attendance    20.0
dtype: float64

## Exercise 3 — Impute numerical values

In [29]:

# TODO: fill age (median), math_score (mean)

df["math_score"] = df["math_score"].fillna(df["math_score"].mean())
df

   student_id   name   age       city  math_score  attendance
0           1  Aanya  21.0      Delhi        85.0        92.0
1           2  Meera  22.0     Mumbai        90.0         NaN
2           3   Riya   NaN       Pune        86.5        85.0
3           4  Pooja  23.0        NaN        88.0        95.0
4           5  Sneha  22.0  Bangalore        92.0        98.0
5           6    Ira   NaN     Mumbai        74.0        80.0
6           7  Naina  21.0       Pune        81.0         NaN
7           8  Kavya  24.0      Delhi        86.5        83.0
8           9   Diya  23.0        NaN        95.0        97.0
9          10   Tara   NaN       Pune        87.0        90.0

In [30]:
df["age"] = df["age"].fillna(df["age"].median())
df

   student_id   name   age       city  math_score  attendance
0           1  Aanya  21.0      Delhi        85.0        92.0
1           2  Meera  22.0     Mumbai        90.0         NaN
2           3   Riya  22.0       Pune        86.5        85.0
3           4  Pooja  23.0        NaN        88.0        95.0
4           5  Sneha  22.0  Bangalore        92.0        98.0
5           6    Ira  22.0     Mumbai        74.0        80.0
6           7  Naina  21.0       Pune        81.0         NaN
7           8  Kavya  24.0      Delhi        86.5        83.0
8           9   Diya  23.0        NaN        95.0        97.0
9          10   Tara  22.0       Pune        87.0        90.0

## Exercise 4 — Impute categorical values

In [31]:

# TODO: fill city with mode

df["city"] = df["city"].fillna(df["city"].mode()[0])
df

   student_id   name   age       city  math_score  attendance
0           1  Aanya  21.0      Delhi        85.0        92.0
1           2  Meera  22.0     Mumbai        90.0         NaN
2           3   Riya  22.0       Pune        86.5        85.0
3           4  Pooja  23.0       Pune        88.0        95.0
4           5  Sneha  22.0  Bangalore        92.0        98.0
5           6    Ira  22.0     Mumbai        74.0        80.0
6           7  Naina  21.0       Pune        81.0         NaN
7           8  Kavya  24.0      Delhi        86.5        83.0
8           9   Diya  23.0       Pune        95.0        97.0
9          10   Tara  22.0       Pune        87.0        90.0

In [32]:
df["attendance"] = df["attendance"].fillna(df["attendance"].median())
df

   student_id   name   age       city  math_score  attendance
0           1  Aanya  21.0      Delhi        85.0        92.0
1           2  Meera  22.0     Mumbai        90.0        91.0
2           3   Riya  22.0       Pune        86.5        85.0
3           4  Pooja  23.0       Pune        88.0        95.0
4           5  Sneha  22.0  Bangalore        92.0        98.0
5           6    Ira  22.0     Mumbai        74.0        80.0
6           7  Naina  21.0       Pune        81.0        91.0
7           8  Kavya  24.0      Delhi        86.5        83.0
8           9   Diya  23.0       Pune        95.0        97.0
9          10   Tara  22.0       Pune        87.0        90.0